// pages/my/my_about/my_about.js
Page({

    /**
     * 页面的初始数据
     */
    data: {
        introdata:"西南大学红十字会成立于1993年，10多年来始终如一地坚持“人道、博爱、奉献”精神，以大学生为主体，教职工共同参与，通过各届会员的共同努力，红会工作得到不断的完善和长足的发展，逐步成长为一个具有一定经验，全面系统化、正规化的红十字基层组织，并取得了可喜成绩，在社会上发挥了较好的影响。",
    },

    /**
     * 生命周期函数--监听页面加载
     */
    onLoad(options) {

    },

    /**
     * 生命周期函数--监听页面初次渲染完成
     */
    onReady() {

    },

    /**
     * 生命周期函数--监听页面显示
     */
    onShow() {

    },

    /**
     * 生命周期函数--监听页面隐藏
     */
    onHide() {

    },

    /**
     * 生命周期函数--监听页面卸载
     */
    onUnload() {

    },

    /**
     * 页面相关事件处理函数--监听用户下拉动作
     */
    onPullDownRefresh() {

    },

    /**
     * 页面上拉触底事件的处理函数
     */
    onReachBottom() {

    },

    /**
     * 用户点击右上角分享
     */
    onShareAppMessage() {

    }
})